
INSERT INTO schools (id, name)
VALUES ('ocean', 'Ocean School'),
       ('mountain', 'Mountain School'),
       ('river', 'River School'),
       ('sky', 'Sky School')
;

INSERT INTO checkout_limit_defaults (id, school_id, grade, max_books, max_days)
VALUES -- ocean school
       (0, 'ocean', 0, 4, 28),
       (1, 'ocean', 1, 4, 28),
       (2, 'ocean', 2, 4, 28),
       (3, 'ocean', 3, 4, 28),
       (4, 'ocean', 4, 4, 28),
       (5, 'ocean', 5, 4, 28),
       (6, 'ocean', 6, 4, 28),
       (7, 'ocean', 99, 4, 28),  -- for parents/teachers
       -- mountain school
       (8, 'mountain', 7, 4, 14),
       (9, 'mountain', 8, 4, 14),
       (10, 'mountain', 9, 4, 14),
       (11, 'mountain', 10, 4, 14),
       (12, 'mountain', 11, 4, 14),
       (13, 'mountain', 99, 4, 14), -- for parents/teachers
       -- river school
       (14, 'river', 0, 5, 28),
       (15, 'river', 1, 5, 28),
       (16, 'river', 2, 5, 28),
       (17, 'river', 3, 5, 28),
       (18, 'river', 4, 5, 28),
       (19, 'river', 5, 5, 28),
       (20, 'river', 6, 5, 28),
       (21, 'river', 99, 5,28), -- for parents/teachers
       -- sky school
       (22, 'sky', 7, 5, 14),
       (23, 'sky', 8, 5, 14),
       (24, 'sky', 9, 5, 14),
       (25, 'sky', 10, 5, 14),
       (26, 'sky', 11, 5, 14),
       (27, 'sky', 99, 5, 14) -- for parents/teachers
;

INSERT INTO book_categories (id, letter, name, starting_book_id, ending_book_id,
                             description, school_id, ccode_content_digits)
VALUES (1, 'A', 'SJ文学作品', 1000000, 1099999, '文学作品', 'ocean', ''),
       (2, 'B', 'SJ文庫', 1100000, 1199999, '文庫', 'ocean', ''),
       (3, 'C', 'SJ民話', 1200000, 1299999, '民話', 'ocean', ''),
       (4, 'D', 'SJ国語', 1300000, 1399999, '国語', 'ocean', ''),
       (5, 'E', 'SJ算数', 1400000, 1499999, '算数', 'ocean', ''),
       (6, 'F', 'SJ理科', 1500000, 1599999, '理科', 'ocean', ''),
       (7, 'G', 'SJ社会', 1600000, 1699999, '社会', 'ocean', ''),
       (8, 'H', 'SJ動物', 1700000, 1799999, '動物', 'ocean', ''),
       (9, 'I', 'SJ推理、戦争', 1800000, 1899999, '推理、戦争', 'ocean', ''),
       (10, 'J', 'SJ伝記', 1900000, 1999999, '伝記', 'ocean', ''),
       (11, 'K', 'SJ予備', 2000000, 2099999, '', 'ocean', ''),
       (12, 'L', 'SJ予備', 2100000, 2199999, '', 'ocean', ''),
       (13, 'M', 'SJ予備', 2200000, 2299999, '', 'ocean', ''),
       (14, 'N', 'SF歴史', 2300000, 2399999, '歴史', 'river', ''),
       (15, 'O', 'SF伝記', 2400000, 2499999, '伝記', 'river', ''),
       (16, 'P', 'SF社会・地理', 2500000, 2599999, '社会・地理', 'river', ''),
       (17, 'Q', 'SF理科', 2600000, 2699999, '理科', 'river', ''),
       (18, 'R', 'SF算数', 2700000, 2799999, '算数', 'river', ''),
       (19, 'S', 'SF芸能・生活・スポーツ', 2800000, 2899999, '芸能・生活・スポーツ', 'river', ''),
       (20, 'T', 'SF国語', 2900000, 2999999, '国語', 'river', ''),
       (21, 'U', 'SF日本文学', 3000000, 3099999, '日本文学', 'river', ''),
       (22, 'V', 'SF外国文学', 3100000, 3199999, '外国文学', 'river', ''),
       (23, 'W', 'SF絵本', 3200000, 3299999, '絵本', 'river', ''),
       (24, 'X', 'SF幼稚部', 3300000, 3399999, '幼稚部', 'river', ''),
       (25, 'Y', 'SF予備', 3400000, 3499999, '', 'river', ''),
       (26, 'Z', 'SF予備', 3500000, 3599999, '', 'river', ''),
       (27, 'あ', 'SF外国文学', 3600000, 3699999, '外国文学', 'sky', ''),
       (28, 'い', 'SF趣味', 3700000, 3799999, '趣味', 'sky', ''),
       (29, 'う', 'SF日本文学', 3800000, 3899999, '日本文学', 'sky', ''),
       (30, 'え', 'SF歴史', 3900000, 3999999, '歴史', 'sky', ''),
       (31, 'お', 'SF社会', 4000000, 4099999, '社会', 'sky', ''),
       (32, 'か', 'SF自然・科学', 4100000, 4199999, '自然・科学', 'sky', ''),
       (33, 'せ', 'SJ中高総記', 4900000, 4999999, '総記', 'mountain', '00,01,02,04'),
       (34, 'そ', 'SJ中高哲学', 5000000, 5099999, '哲学', 'mountain', '10,11,12,14,15,16'),
       (35, 'た', 'SJ中高歴史', 5100000, 5199999, '歴史', 'mountain', '20,21,22,23,25,26'),
       (36, 'ち', 'SJ中高社会科学', 5200000, 5299999, '社会科学', 'mountain',
        '30,31,32,33,34,36,37,39'),
       (37, 'つ', 'SJ中高自然科学', 5300000, 5399999, '自然科学', 'mountain',
        '40,41,42,43,44,45,47'),
       (38, 'て', 'SJ中高技術', 5400000, 5499999, '技術', 'mountain',
        '50,51,52,53,54,55,56,57,58'),
       (39, 'と', 'SJ中高産業', 5500000, 5599999, '産業', 'mountain', '60,61,62,63,65'),
       (40, 'な', 'SJ中高芸術', 5600000, 5699999, '芸術・娯楽・家事', 'mountain',
        '70,71,72,73,74,75,76,77'),
       (41, 'に', 'SJ中高言語', 5700000, 5799999, '言語', 'mountain', '80,81,82,84,85,87'),
       (42, 'ぬ', 'SJ中高文学', 5800000, 5899999, '文学', 'mountain', '90,91,92,93,95,97,98'),
       (43, 'ね', 'SJ中高漫画', 5900000, 5999999, '漫画', 'mountain', '79'),
       (44, 'の', 'SJ中高CD・DVD', 6000000, 6099999, 'CD・DVD', 'mountain', ''),
       (45, 'は', 'SJ中高その他', 6100000, 6199999, 'その他', 'mountain', '')
;
